; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck package - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - package ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action load-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action unload-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action board-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action disembark-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action drive-truck
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location
    ?truck - truck)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action walk
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-7-5-11)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	driver6 - driver
	driver7 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	package1 - package
	package2 - package
	package3 - package
	package4 - package
	package5 - package
	package6 - package
	package7 - package
	package8 - package
	package9 - package
	package10 - package
	package11 - package
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	p0-2 - location
	p0-4 - location
	p1-5 - location
	p2-3 - location
	p2-4 - location
	p2-5 - location
	p3-0 - location
	p3-4 - location
	p3-5 - location
	p4-1 - location
	p6-0 - location
	)
	(:init
	(at driver1 s5)
	(at driver2 s4)
	(at driver3 s5)
	(at driver4 s4)
	(at driver5 s1)
	(at driver6 s4)
	(at driver7 s3)
	(at truck1 s5)
	(empty truck1)
	(at truck2 s1)
	(empty truck2)
	(at truck3 s0)
	(empty truck3)
	(at truck4 s2)
	(empty truck4)
	(at truck5 s3)
	(empty truck5)
	(at package1 s2)
	(at package2 s3)
	(at package3 s0)
	(at package4 s2)
	(at package5 s4)
	(at package6 s4)
	(at package7 s1)
	(at package8 s4)
	(at package9 s0)
	(at package10 s6)
	(at package11 s6)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(path s0 p0-4)
	(path p0-4 s0)
	(path s4 p0-4)
	(path p0-4 s4)
	(path s1 p1-5)
	(path p1-5 s1)
	(path s5 p1-5)
	(path p1-5 s5)
	(path s2 p2-3)
	(path p2-3 s2)
	(path s3 p2-3)
	(path p2-3 s3)
	(path s2 p2-4)
	(path p2-4 s2)
	(path s4 p2-4)
	(path p2-4 s4)
	(path s2 p2-5)
	(path p2-5 s2)
	(path s5 p2-5)
	(path p2-5 s5)
	(path s3 p3-0)
	(path p3-0 s3)
	(path s0 p3-0)
	(path p3-0 s0)
	(path s3 p3-4)
	(path p3-4 s3)
	(path s4 p3-4)
	(path p3-4 s4)
	(path s3 p3-5)
	(path p3-5 s3)
	(path s5 p3-5)
	(path p3-5 s5)
	(path s4 p4-1)
	(path p4-1 s4)
	(path s1 p4-1)
	(path p4-1 s1)
	(path s6 p6-0)
	(path p6-0 s6)
	(path s0 p6-0)
	(path p6-0 s0)
	(link s0 s4)
	(link s4 s0)
	(link s1 s2)
	(link s2 s1)
	(link s1 s5)
	(link s5 s1)
	(link s2 s0)
	(link s0 s2)
	(link s2 s3)
	(link s3 s2)
	(link s2 s4)
	(link s4 s2)
	(link s2 s5)
	(link s5 s2)
	(link s2 s6)
	(link s6 s2)
	(link s3 s0)
	(link s0 s3)
	(link s3 s4)
	(link s4 s3)
	(link s4 s5)
	(link s5 s4)
	(link s5 s3)
	(link s3 s5)
	(link s5 s6)
	(link s6 s5)
	(link s6 s0)
	(link s0 s6)
	(link s6 s4)
	(link s4 s6)
)
	(:goal (and
	(at driver2 s0)
	(at driver4 s2)
	(at driver5 s4)
	(at truck1 s5)
	(at truck2 s3)
	(at truck3 s3)
	(at truck4 s1)
	(at truck5 s6)
	(at package1 s5)
	(at package3 s4)
	(at package5 s5)
	(at package6 s4)
	(at package8 s5)
	(at package9 s1)
	(at package10 s4)
	(at package11 s0)
	))


)

; plan
1. (board-truck driver3 s5 truck1)
   deleted: (at driver3 s5) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 2 of 16
2. (drive-truck driver3 s5 s2 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s2)
   goals met: 1 of 16
3. (board-truck driver7 s3 truck5)
   deleted: (at driver7 s3) (empty truck5)
   added: (driving driver7 truck5)
   goals met: 1 of 16
4. (drive-truck driver7 s3 s0 truck5)
   deleted: (at truck5 s3)
   added: (at truck5 s0)
   goals met: 1 of 16
5. (load-truck s2 package1 truck1)
   deleted: (at package1 s2)
   added: (in package1 truck1)
   goals met: 1 of 16
6. (drive-truck driver3 s2 s4 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s4)
   goals met: 1 of 16
7. (load-truck s4 package8 truck1)
   deleted: (at package8 s4)
   added: (in package8 truck1)
   goals met: 1 of 16
8. (drive-truck driver3 s4 s5 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s5)
   goals met: 2 of 16
9. (unload-truck s5 package8 truck1)
   deleted: (in package8 truck1)
   added: (at package8 s5)
   goals met: 3 of 16
10. (unload-truck s5 package1 truck1)
   deleted: (in package1 truck1)
   added: (at package1 s5)
   goals met: 4 of 16
11. (load-truck s0 package9 truck5)
   deleted: (at package9 s0)
   added: (in package9 truck5)
   goals met: 4 of 16
12. (drive-truck driver7 s0 s6 truck5)
   deleted: (at truck5 s0)
   added: (at truck5 s6)
   goals met: 5 of 16
13. (load-truck s6 package11 truck5)
   deleted: (at package11 s6)
   added: (in package11 truck5)
   goals met: 5 of 16
14. (drive-truck driver7 s6 s0 truck5)
   deleted: (at truck5 s6)
   added: (at truck5 s0)
   goals met: 4 of 16
15. (load-truck s0 package3 truck5)
   deleted: (at package3 s0)
   added: (in package3 truck5)
   goals met: 4 of 16
16. (unload-truck s0 package11 truck5)
   deleted: (in package11 truck5)
   added: (at package11 s0)
   goals met: 5 of 16
17. (drive-truck driver7 s0 s2 truck5)
   deleted: (at truck5 s0)
   added: (at truck5 s2)
   goals met: 5 of 16
18. (walk driver2 s4 p0-4)
   deleted: (at driver2 s4)
   added: (at driver2 p0-4)
   goals met: 5 of 16
19. (walk driver2 p0-4 s0)
   deleted: (at driver2 p0-4)
   added: (at driver2 s0)
   goals met: 6 of 16
20. (walk driver4 s4 p2-4)
   deleted: (at driver4 s4)
   added: (at driver4 p2-4)
   goals met: 6 of 16
21. (drive-truck driver7 s2 s4 truck5)
   deleted: (at truck5 s2)
   added: (at truck5 s4)
   goals met: 6 of 16
22. (load-truck s4 package5 truck5)
   deleted: (at package5 s4)
   added: (in package5 truck5)
   goals met: 6 of 16
23. (drive-truck driver7 s4 s5 truck5)
   deleted: (at truck5 s4)
   added: (at truck5 s5)
   goals met: 6 of 16
24. (unload-truck s5 package5 truck5)
   deleted: (in package5 truck5)
   added: (at package5 s5)
   goals met: 7 of 16
25. (drive-truck driver7 s5 s6 truck5)
   deleted: (at truck5 s5)
   added: (at truck5 s6)
   goals met: 8 of 16
26. (load-truck s6 package10 truck5)
   deleted: (at package10 s6)
   added: (in package10 truck5)
   goals met: 8 of 16
27. (drive-truck driver7 s6 s4 truck5)
   deleted: (at truck5 s6)
   added: (at truck5 s4)
   goals met: 7 of 16
28. (unload-truck s4 package3 truck5)
   deleted: (in package3 truck5)
   added: (at package3 s4)
   goals met: 8 of 16
29. (unload-truck s4 package10 truck5)
   deleted: (in package10 truck5)
   added: (at package10 s4)
   goals met: 9 of 16
30. (drive-truck driver7 s4 s5 truck5)
   deleted: (at truck5 s4)
   added: (at truck5 s5)
   goals met: 9 of 16
31. (walk driver4 p2-4 s2)
   deleted: (at driver4 p2-4)
   added: (at driver4 s2)
   goals met: 10 of 16
32. (drive-truck driver7 s5 s1 truck5)
   deleted: (at truck5 s5)
   added: (at truck5 s1)
   goals met: 10 of 16
33. (unload-truck s1 package9 truck5)
   deleted: (in package9 truck5)
   added: (at package9 s1)
   goals met: 11 of 16
34. (drive-truck driver7 s1 s5 truck5)
   deleted: (at truck5 s1)
   added: (at truck5 s5)
   goals met: 11 of 16
35. (drive-truck driver7 s5 s6 truck5)
   deleted: (at truck5 s5)
   added: (at truck5 s6)
   goals met: 12 of 16
36. (board-truck driver5 s1 truck2)
   deleted: (at driver5 s1) (empty truck2)
   added: (driving driver5 truck2)
   goals met: 12 of 16
37. (drive-truck driver5 s1 s5 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s5)
   goals met: 12 of 16
38. (drive-truck driver5 s5 s3 truck2)
   deleted: (at truck2 s5)
   added: (at truck2 s3)
   goals met: 13 of 16
39. (drive-truck driver5 s3 s4 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s4)
   goals met: 12 of 16
40. (disembark-truck driver5 s4 truck2)
   deleted: (driving driver5 truck2)
   added: (at driver5 s4) (empty truck2)
   goals met: 13 of 16
41. (board-truck driver6 s4 truck2)
   deleted: (at driver6 s4) (empty truck2)
   added: (driving driver6 truck2)
   goals met: 13 of 16
42. (drive-truck driver6 s4 s3 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s3)
   goals met: 14 of 16
43. (board-truck driver2 s0 truck3)
   deleted: (at driver2 s0) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 13 of 16
44. (drive-truck driver2 s0 s3 truck3)
   deleted: (at truck3 s0)
   added: (at truck3 s3)
   goals met: 14 of 16
45. (disembark-truck driver2 s3 truck3)
   deleted: (driving driver2 truck3)
   added: (at driver2 s3) (empty truck3)
   goals met: 14 of 16
46. (walk driver2 s3 p3-0)
   deleted: (at driver2 s3)
   added: (at driver2 p3-0)
   goals met: 14 of 16
47. (walk driver2 p3-0 s0)
   deleted: (at driver2 p3-0)
   added: (at driver2 s0)
   goals met: 15 of 16
48. (walk driver1 s5 p2-5)
   deleted: (at driver1 s5)
   added: (at driver1 p2-5)
   goals met: 15 of 16
49. (walk driver1 p2-5 s2)
   deleted: (at driver1 p2-5)
   added: (at driver1 s2)
   goals met: 15 of 16
50. (board-truck driver1 s2 truck4)
   deleted: (at driver1 s2) (empty truck4)
   added: (driving driver1 truck4)
   goals met: 15 of 16
51. (drive-truck driver1 s2 s1 truck4)
   deleted: (at truck4 s2)
   added: (at truck4 s1)
   goals met: 16 of 16
